socialNetwork/benchmark_requests.txt
Running 10s test @ http://localhost:8080/wrk2-api/home-timeline/read
  10 threads and 10 connections

  Thread calibration: mean lat.: 520.369ms, rate sampling interval: 1665ms
  Thread calibration: mean lat.: 1991.167ms, rate sampling interval: 8294ms
  Thread calibration: mean lat.: 1829.986ms, rate sampling interval: 8032ms
  Thread calibration: mean lat.: 1967.808ms, rate sampling interval: 8253ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.03s   694.69ms   2.41s    60.35%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  811.01ms
 75.000%    1.60s 
 90.000%    2.00s 
 99.000%    2.41s 
 99.900%    2.58s 
 99.990%    2.61s 
 99.999%    2.61s 
100.000%    2.61s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.937     0.000000            1         1.00
     186.623     0.100000          472         1.11
     357.887     0.200000          944         1.25
     500.991     0.300000         1415         1.43
     634.879     0.400000         1888         1.67
     811.007     0.500000         2358         2.00
    1090.559     0.550000         2595         2.22
    1296.383     0.600000         2831         2.50
    1447.935     0.650000         3067         2.86
    1525.759     0.700000         3307         3.33
    1602.559     0.750000         3537         4.00
    1672.191     0.775000         3655         4.44
    1768.447     0.800000         3773         5.00
    1831.935     0.825000         3897         5.71
    1871.871     0.850000         4009         6.67
    1931.263     0.875000         4127         8.00
    1953.791     0.887500         4186         8.89
    2002.943     0.900000         4245        10.00
    2062.335     0.912500         4305        11.43
    2105.343     0.925000         4364        13.33
    2146.303     0.937500         4427        16.00
    2172.927     0.943750         4454        17.78
    2189.311     0.950000         4485        20.00
    2207.743     0.956250         4510        22.86
    2238.463     0.962500         4541        26.67
    2256.895     0.968750         4571        32.00
    2271.231     0.971875         4585        35.56
    2281.471     0.975000         4602        40.00
    2285.567     0.978125         4614        45.71
    2301.951     0.981250         4628        53.33
    2355.199     0.984375         4643        64.00
    2365.439     0.985938         4652        71.11
    2383.871     0.987500         4660        80.00
    2406.399     0.989062         4665        91.43
    2443.263     0.990625         4672       106.67
    2490.367     0.992188         4681       128.00
    2496.511     0.992969         4683       142.22
    2508.799     0.993750         4689       160.00
    2519.039     0.994531         4692       182.86
    2525.183     0.995313         4694       213.33
    2539.519     0.996094         4698       256.00
    2557.951     0.996484         4702       284.44
    2557.951     0.996875         4702       320.00
    2559.999     0.997266         4704       365.71
    2568.191     0.997656         4707       426.67
    2568.191     0.998047         4707       512.00
    2576.383     0.998242         4709       568.89
    2576.383     0.998437         4709       640.00
    2578.431     0.998633         4710       731.43
    2580.479     0.998828         4711       853.33
    2582.527     0.999023         4712      1024.00
    2582.527     0.999121         4712      1137.78
    2596.863     0.999219         4713      1280.00
    2596.863     0.999316         4713      1462.86
    2598.911     0.999414         4714      1706.67
    2598.911     0.999512         4714      2048.00
    2598.911     0.999561         4714      2275.56
    2600.959     0.999609         4715      2560.00
    2600.959     0.999658         4715      2925.71
    2600.959     0.999707      Running 10s test @ http://localhost:8080/wrk2-api/user-timeline/read
  10 threads and 10 connections

  Thread calibration: mean lat.: 2855.401ms, rate sampling interval: 11231ms
  Thread calibration: mean lat.: 2817.597ms, rate sampling interval: 10846ms
  Thread calibration: mean lat.: 2085.022ms, rate sampling interval: 7069ms
  Thread calibration: mean lat.: 2890.083ms, rate sampling interval: 11444ms
  Thread calibration: mean lat.: 1889.302ms, rate sampling interval: 6770ms
  Thread calibration: mean lat.: 2877.262ms, rate sampling interval: 11018ms
  Thread calibration: mean lat.: 2201.091ms, rate sampling interval: 7565ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/user-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.23s     1.33s    4.55s    61.24%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.22s 
 75.000%    3.39s 
 90.000%    4.04s 
 99.000%    4.55s 
 99.900%    4.66s 
 99.990%    4.67s 
 99.999%    4.67s 
100.000%    4.67s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      59.711     0.000000            1         1.00
     323.327     0.100000          165         1.11
     989.695     0.200000          330         1.25
    1129.471     0.300000          494         1.43
    1797.119     0.400000          659         1.67
    2220.031     0.500000          825         2.00
    2459.647     0.550000          906         2.22
    2715.647     0.600000          989         2.50
    2926.591     0.650000         1070         2.86
    3153.919     0.700000         1153         3.33
    3389.439     0.750000         1236         4.00
    3508.223     0.775000         1277         4.44
    3590.143     0.800000         1317         5.00
    3715.071     0.825000         1358         5.71
    3858.431     0.850000         1401         6.67
    3973.119     0.875000         1441         8.00
    4020.223     0.887500         1461         8.89
    4040.703     0.900000         1482        10.00
    4057.087     0.912500         1503        11.43
    4118.527     0.925000         1523        13.33
    4194.303     0.937500         1545        16.00
    4243.455     0.943750         1554        17.78
    4300.799     0.950000         1565        20.00
    4329.471     0.956250         1574        22.86
    4382.719     0.962500         1586        26.67
    4419.583     0.968750         1596        32.00
    4456.447     0.971875         1600        35.56
    4476.927     0.975000         1606        40.00
    4485.119     0.978125         1610        45.71
    4505.599     0.981250         1616        53.33
    4513.791     0.984375         1621        64.00
    4521.983     0.985938         1626        71.11
    4521.983     0.987500         1626        80.00
    4534.271     0.989062         1629        91.43
    4550.655     0.990625         1631       106.67
    4558.847     0.992188         1634       128.00
    4583.423     0.992969         1635       142.22
    4612.095     0.993750         1636       160.00
    4628.479     0.994531         1637       182.86
    4640.767     0.995313         1639       213.33
    4644.863     0.996094         1640       256.00
    4653.055     0.996484         1642       284.44
    4653.055     0.996875         1642       320.00
    4653.055     0.997266         1642       365.71
    4657.151     0.997656         1643       426.67
    4657.151     0.998047         1643       512.00
    4661.247     0.998242         1644       568.89
    4661.247     0.998437         1644       640.00
    4661.247     0.998633         1644       731.43
    4665.343     0.998828         1645       853.33
    4665.343     0.999023         1645      1024.00
    4665.343     0.999121         1645      1137.78
    4665.343     0.999219         1645      1280.00
    4665.343     0.999316         1645      1462.86
    4669.439     0.999414         1646      1706.67
    46   4715      3413.33
    2600.959     0.999756         4715      4096.00
    2600.959     0.999780         4715      4551.11
    2607.103     0.999805         4716      5120.00
    2607.103     1.000000         4716          inf
#[Mean    =     1027.912, StdDeviation   =      694.691]
#[Max     =     2605.056, Total count    =         4716]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  7022 requests in 10.00s, 1.33MB read
Requests/sec:    701.97  
Transfer/sec:    136.42KB
69.439     1.000000         1646          inf
#[Mean    =     2229.449, StdDeviation   =     1327.326]
#[Max     =     4665.344, Total count    =         1646]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  4828 requests in 10.00s, 1.08MB read
Requests/sec:    482.61  
Transfer/sec:    110.25KB
Running 10s test @ http://localhost:8080/wrk2-api/post/compose
  10 threads and 10 connections

  Thread calibration: mean lat.: 3765.456ms, rate sampling interval: 13033ms
  Thread calibration: mean lat.: 3800.489ms, rate sampling interval: 13901ms
  Thread calibration: mean lat.: 3643.407ms, rate sampling interval: 12304ms
  Thread calibration: mean lat.: 3570.378ms, rate sampling interval: 13213ms
  Thread calibration: mean lat.: 3578.248ms, rate sampling interval: 12713ms
  Thread calibration: mean lat.: 3652.185ms, rate sampling interval: 12156ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.72s     2.10s    7.37s    58.79%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.74s 
 75.000%    5.51s 
 90.000%    6.51s 
 99.000%    7.37s 
 99.900%    7.61s 
 99.990%    7.66s 
 99.999%    7.66s 
100.000%    7.66s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      48.191     0.000000            1         1.00
     588.287     0.100000          108         1.11
    1562.623     0.200000          215         1.25
    2480.127     0.300000          323         1.43
    3135.487     0.400000          430         1.67
    3735.551     0.500000          538         2.00
    4122.623     0.550000          592         2.22
    4431.871     0.600000          646         2.50
    4784.127     0.650000          699         2.86
    5173.247     0.700000          753         3.33
    5505.023     0.750000          807         4.00
    5672.959     0.775000          834         4.44
    5865.471     0.800000          860         5.00
    6037.503     0.825000          887         5.71
    6201.343     0.850000          914         6.67
    6348.799     0.875000          941         8.00
    6434.815     0.887500          955         8.89
    6508.543     0.900000          968        10.00
    6586.367     0.912500          981        11.43
    6692.863     0.925000          995        13.33
    6770.687     0.937500         1008        16.00
    6832.127     0.943750         1017        17.78
    6860.799     0.950000         1023        20.00
    6905.855     0.956250         1028        22.86
    6955.007     0.962500         1035        26.67
    7041.023     0.968750         1042        32.00
    7065.599     0.971875         1045        35.56
    7110.655     0.975000         1049        40.00
    7147.519     0.978125         1052        45.71
    7184.383     0.981250         1055        53.33
    7249.919     0.984375         1059        64.00
    7262.207     0.985938         1060        71.11
    7303.167     0.987500         1062        80.00
    7372.799     0.989062         1065        91.43
    7372.799     0.990625         1065       106.67
    7405.567     0.992188         1067       128.00
    7446.527     0.992969         1068       142.22
    7450.623     0.993750         1069       160.00
    7479.295     0.994531         1070       182.86
    7479.295     0.995313         1070       213.33
    7483.391     0.996094         1071       256.00
    7544.831     0.996484         1072       284.44
    7544.831     0.996875         1072       320.00
    7565.311     0.997266         1073       365.71
    7565.311     0.997656         1073       426.67
    7565.311     0.998047         1073       512.00
    7610.367     0.998242         1074       568.89
    7610.367     0.998437         1074       640.00
    7610.367     0.998633         1074       731.43
    7610.367     0.998828         1074       853.33
    7610.367     0.999023         1074      1024.00
    7659.519     0.999121         1075      1137.78
    7659.519     1.000000         1075          inf
#[Mean    =     3715.967, StdDeviation   =     2096.042]
#[Max     =     7655.424, Total count    =         1075]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  2755 requests in 10.01s, 578.44KB read
Requests/sec:    275.35  
Transfer/sec:     57.81KB